#!/bin/bash

###########################################################
# if语句用法
#   - 基本用法
#   - 字符串比较运算
#   - 数字比较运算
#   - 逻辑比较运算
#   - 测试文件属性
#   - 正则匹配运算
# 总结：
#   if [[ "$str" =~ ^A.*Z$ ]]; 切不可
#   if [[ "$str" =~ "^A.*Z$" ]]; 或
#   if [[ "$str" =~ '^A.*Z$' ]];
###########################################################


############################################################
# 基本用法
s="hellow"
if [[ "$s" == "hello" ]]; then
    : # 空语句，什么也不干
fi

if [[ "$s" == "hello" ]]; then
    echo "..."
else
    echo "..."
fi

if [[ "$s" == "hello" ]]; then
    echo "..."
elif [[ "$s" == "world" ]]; then
    echo "..."
else
    echo "..."
fi
############################################################



############################################################
# 字符串比较运算: ==, >, <, >=, <=, !=
s="hello";
if [[ "$s" == "hello" ]]; then
    echo "..."
fi

## 判断一个字符串是否为空
s=""
if [[ "x$s" == "x" ]]; then
    echo "s is empty."
fi
############################################################

############################################################
# 数字比较运算 -eq, -gt, -lt, -ge, -le, -ne
n=10;
if [[ $n -eq 10 ]]; then
    echo "n == 10"
fi
############################################################

############################################################
# 逻辑运算 && || ! -a -o
n=10
s="hello"

if [[ $n -eq 10 && $s == "hello" ]]; then
    echo "$n -eq 10 && $s == \"hello\"";
fi
if [[ $n -eq 10 ]] && [[ $s == "hello" ]]; then
    echo "$n -eq 10 && $s == \"hello\"";
fi

# 注意这只能是单中括号，王八的屁股规定！
if [ $n -eq 10 -a $s == "hello" ]; then
    echo "$n -eq 10 -a $s == hello";
fi
############################################################

############################################################
# if 测试文件属性
file="/etc/passwd"
if [[ -f "$file" ]]; then
    echo "true"
else 
    echo "false"
fi

# 判断file是否为存在，且当前用户对file是否可以读、写、执行这个file。
if [[ -x "$file" && -w "$file" && -r "$file" ]];then
    echo "true"
else
    echo "-_-|"
fi
############################################################

############################################################
# if中的正则匹配运算
## url是否以http开头，以flv结尾
url="http://www.test.me/youtube.flv";
if [[ "$url" =~ ^http://.*.flv$ ]]; then
    echo "true"
else
    echo "false"
fi

## 判断字符串是否为纯数字
s="1234567890"
if [[ "$s" =~ ^[0-9][0-9]*$ ]]; then
    echo "true"
fi
############################################################
